{
  "backend/main.mo": "Defines core backend types and data models for bookings, providers, rentals, user profiles, and related enums, with comparison utilities for sorting.",
  "feature_evidence.json": "Records feature evidence identifying the removal of the Admin button from the site header and the impacted file and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark mode values, and base styling for the app.",
  "frontend/index.html": "Base HTML file that mounts the React app and loads the main entry script.",
  "frontend/src/App.tsx": "Configures TanStack Router with all routes for services, bookings, profile, provider flows, rentals, and admin pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied card with an alert icon and a button to return home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication state with retry handling.",
  "frontend/src/components/auth/RequireLogin.tsx": "Gatekeeper component that shows a login prompt unless the user is authenticated.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Renders a status badge with label and variant based on booking status.",
  "frontend/src/components/brand/BrandLogo.tsx": "Simple brand logo component rendering the text EYEGIC with responsive header and default variants.",
  "frontend/src/components/forms/AvailabilitySelector.tsx": "Date selector supporting single or range mode with time inputs and formatted output via onChange.",
  "frontend/src/components/forms/MobileNumberOtpGate.tsx": "Handles mobile input, validates number, triggers OTP flow, and submits only after verification.",
  "frontend/src/components/forms/MockOtpVerification.tsx": "Mock 4‑digit OTP generator and verifier with resend, loading state, and success display.",
  "frontend/src/components/forms/OptionalPhotoUpload.tsx": "Optional image uploader with preview and remove support, emitting selected file changes.",
  "frontend/src/components/forms/RepairIssueTypeMultiSelect.tsx": "Checkbox-based multi-select for repair issue types, updating selected values.",
  "frontend/src/components/icons/WhatsAppIcon.tsx": "SVG component rendering a WhatsApp icon.",
  "frontend/src/components/layout/header/AdminNotificationsControl.tsx": "Dropdown control showing admin notifications count and linking to the admin notifications page.",
  "frontend/src/components/layout/header/MyProfileControl.tsx": "Profile menu for authenticated users with view profile and logout actions, supporting desktop and mobile variants.",
  "frontend/src/components/layout/PageLayout.tsx": "Page wrapper applying max-width, title, and description before rendering children.",
  "frontend/src/components/layout/RootLayout.tsx": "Root layout with header, outlet-rendered content, and footer.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with navigation links, contact actions, and build info display.",
  "frontend/src/components/layout/SiteHeader.tsx": "Site header with navigation, login/logout handling, contact dropdown, and mobile menu logic.",
  "frontend/src/components/profile/FrameShapeIcons.tsx": "SVG icon components representing various eyeglass frame shapes.",
  "frontend/src/components/profile/FrameShapePicker.tsx": "Checkbox-based selector allowing users to choose one or more eyeglass frame shapes.",
  "frontend/src/config/buildInfo.ts": "Exports a build identifier string sourced from environment variables.",
  "frontend/src/hooks/admin/useMobileNumberVerifications.ts": "Fetches mobile number verification logs when an admin is authenticated.",
  "frontend/src/hooks/auth/useIsCallerAdmin.ts": "Determines whether the current caller has admin privileges.",
  "frontend/src/hooks/bookings/useBooking.ts": "Fetches a single booking by ID using the actor API.",
  "frontend/src/hooks/bookings/useCreateOpticianBooking.ts": "Creates an optician booking and invalidates customer booking queries on success.",
  "frontend/src/hooks/bookings/useCreateRentalBooking.ts": "Creates a rental booking and refreshes customer bookings afterward.",
  "frontend/src/hooks/bookings/useCreateRepairBooking.ts": "Creates a repair booking and invalidates related booking queries on success.",
  "frontend/src/hooks/bookings/useCustomerBookings.ts": "Retrieves all bookings for the logged‑in customer.",
  "frontend/src/hooks/bookings/useGetBooking.ts": "Fetches booking details for a given booking ID.",
  "frontend/src/hooks/bookings/useLogMobileNumberVerification.ts": "Logs a mobile number verification event through the actor API.",
  "frontend/src/hooks/bookings/useProviderBookings.ts": "Fetches bookings assigned to a service provider.",
  "frontend/src/hooks/bookings/useUpdateBookingStatus.ts": "Updates a booking’s status and invalidates multiple related queries.",
  "frontend/src/hooks/branding/useSiteLogo.ts": "Empty placeholder hook for site logo logic.",
  "frontend/src/hooks/profile/useCallerUserProfile.ts": "Fetches the logged‑in user’s profile and exposes loading and fetched flags.",
  "frontend/src/hooks/profile/useProfileCompletion.ts": "Retrieves the user’s profile completion percentage if authenticated.",
  "frontend/src/hooks/profile/useProfilePictures.ts": "Mutations to update profile or prescription pictures and refresh profile data.",
  "frontend/src/hooks/profile/useSaveCallerUserProfile.ts": "Saves the authenticated user’s profile and refreshes related queries.",
  "frontend/src/hooks/provider/useProvider.ts": "Provides hooks to fetch a provider for the logged‑in identity and to onboard a new provider using react‑query mutations.",
  "frontend/src/hooks/rentals/useRentalCatalog.ts": "Fetches the rental catalog from the backend via the actor when available.",
  "frontend/src/hooks/routing/useIsHomeRoute.ts": "Determines if the current normalized pathname represents the home route and logs diagnostics in development.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider with login, logout, identity persistence, and related state management.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables, dark mode styles, and custom utility classes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts the root component.",
  "frontend/src/pages/admin/AdminNotificationsPage.tsx": "Admin page displaying mobile number verification logs with access control and loading states.",
  "frontend/src/pages/bookings/BookingDetailPage.tsx": "Displays detailed information for a specific booking, including type, status, pricing, and service-specific fields with loading and error states.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingConfirmationPage.tsx": "Presents confirmation details for a mobile optician booking, including status, service info, and user contact data.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingPage.tsx": "Guides users through a multi‑step flow to create a mobile optician booking, including mobile verification, service selection, form input, and submission.",
  "frontend/src/pages/bookings/MyBookingsPage.tsx": "Shows a logged-in user's list of bookings with key details, statuses, and navigation to individual booking pages.",
  "frontend/src/pages/bookings/rentals/RentalBookingConfirmationPage.tsx": "Displays confirmation and details for a completed eyewear rental booking, including fees, address, and navigation options.",
  "frontend/src/pages/bookings/rentals/RentalBookingPage.tsx": "Allows users to book a rental item by selecting rental duration, entering delivery details, viewing calculated pricing, and submitting the booking.",
  "frontend/src/pages/bookings/repairs/RepairRequestConfirmationPage.tsx": "Displays confirmation details for a submitted repair booking, loading the booking by ID and handling invalid, loading, and error states.",
  "frontend/src/pages/bookings/repairs/RepairRequestPage.tsx": "Collects user info, repair issues, and address to create a repair booking, including OTP verification and form submission.",
  "frontend/src/pages/HomePage.tsx": "Home page with service selection, mobile number OTP verification flow, and navigation to service routes.",
  "frontend/src/pages/profile/MyProfilePage.tsx": "Allows users to view and edit their profile, including personal details, frame preferences, and uploading profile or prescription pictures.",
  "frontend/src/pages/provider/ProviderDashboardPage.tsx": "Shows provider profile and assigned bookings, allowing providers to update booking statuses and access onboarding if unregistered.",
  "frontend/src/pages/provider/ProviderOnboardingPage.tsx": "Handles provider registration with validation, phone/email verification, service area entry, service selection, and onboarding submission.",
  "frontend/src/pages/rentals/RentalItemDetailPage.tsx": "Displays detailed information for a rental item, including pricing, availability, and features, with loading and not-found states.",
  "frontend/src/pages/rentals/RentalsCatalogPage.tsx": "Shows a searchable and filterable catalog of rental items with availability indicators and navigation to item details.",
  "frontend/src/pages/services/MobileOpticianPage.tsx": "Presents the mobile optician service with features, imagery, and a booking button.",
  "frontend/src/pages/services/RentalsPage.tsx": "Introduces the eyewear rental service with benefits, imagery, and a link to browse the catalog.",
  "frontend/src/pages/services/RepairsPage.tsx": "Describes eyewear repair services, listing available repairs and providing a booking link.",
  "frontend/src/pages/settings/BrandingLogoPage.tsx": "Empty file placeholder for branding logo settings.",
  "frontend/src/utils/currency.ts": "Provides helper functions to format numbers as INR currency strings.",
  "frontend/src/utils/homeOtpSession.ts": "Manages session storage for home-flow OTP verification and associated mobile numbers.",
  "frontend/src/utils/logoDataUrl.ts": "Empty utility file placeholder for logo data URL handling.",
  "frontend/src/utils/profileCompletionMock.ts": "Returns a fixed mock profile completion percentage for testing.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash params, persisting them in sessionStorage, and cleaning them from the hash.",
  "frontend/src/utils/validation.ts": "Provides validation and sanitization for phone numbers, emails, and PIN codes.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, themes, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project state file tracking versions, features, and requests for the Eyegic project."
}