{
  "backend/main.mo": "Defines booking, provider, rental, and user profile types with compare functions, manages state in maps, and exposes profile read/write APIs with access control.",
  "feature_evidence.json": "Describes feature evidence for updating the app to use the latest Eyegic logo asset, listing affected files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files, detailing UI changes, animations, and logo updates.",
  "frontend/index.css": "Sets up Tailwind base layers and defines extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Minimal HTML entry point loading the root React application.",
  "frontend/src/App.tsx": "Configures the main application layout and defines all routes using TanStack Router.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Renders an access‑denied message with a button to return home.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout handling using Internet Identity with UI state reflecting auth status.",
  "frontend/src/components/auth/RequireLogin.tsx": "Wraps protected content, showing a login prompt when the user is unauthenticated.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Displays a styled badge for a booking status using predefined label and variant mappings.",
  "frontend/src/components/brand/BrandLogo.tsx": "Shows the Eyegic logo using the latest generated asset with size‑based class variants.",
  "frontend/src/components/forms/OptionalPhotoUpload.tsx": "Allows optional image upload with preview and removal controls.",
  "frontend/src/components/layout/PageLayout.tsx": "Provides a page wrapper with optional title/description and configurable max‑width.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with navigation sections, branding, and a dynamic copyright link referencing caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Displays the site header with logo, navigation links, login controls, and a responsive mobile menu.",
  "frontend/src/hooks/bookings/useBooking.ts": "Fetches a single booking by ID using the actor and react-query.",
  "frontend/src/hooks/bookings/useCreateOpticianBooking.ts": "Creates an optician booking via the actor and invalidates customer booking queries.",
  "frontend/src/hooks/bookings/useCreateRentalBooking.ts": "Creates a rental booking and refreshes customer booking data.",
  "frontend/src/hooks/bookings/useCreateRepairBooking.ts": "Creates a repair booking with provided details and invalidates customer bookings.",
  "frontend/src/hooks/bookings/useCustomerBookings.ts": "Retrieves all bookings for the current customer using the actor.",
  "frontend/src/hooks/bookings/useProviderBookings.ts": "Fetches provider-specific bookings for the logged-in provider.",
  "frontend/src/hooks/bookings/useUpdateBookingStatus.ts": "Updates a booking's status and invalidates related booking queries.",
  "frontend/src/hooks/provider/useProvider.ts": "Loads provider data for the authenticated identity and provides a mutation to onboard new providers.",
  "frontend/src/hooks/rentals/useRentalCatalog.ts": "Fetches the rental item catalog from the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and identity loading.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/bookings/BookingDetailPage.tsx": "Displays detailed information for a specific booking, including status, service details, address, and preferred time.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingConfirmationPage.tsx": "Presents confirmation details for a completed mobile optician booking with service info, time, and price summary.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingPage.tsx": "Provides a form for creating a mobile optician booking, handling service selection, pricing, validation, and submission.",
  "frontend/src/pages/bookings/MyBookingsPage.tsx": "Shows a logged‑in user's list of bookings with status, schedule, location, and navigation to booking details.",
  "frontend/src/pages/bookings/rentals/RentalBookingConfirmationPage.tsx": "Shows confirmation details for a rental booking including address, rental info, fees, and navigation options.",
  "frontend/src/pages/bookings/rentals/RentalBookingPage.tsx": "Page for creating a rental booking, collecting duration and address, calculating price, and submitting via API.",
  "frontend/src/pages/bookings/repairs/RepairRequestConfirmationPage.tsx": "Displays confirmation and details of a submitted repair request, loading the booking and showing its status.",
  "frontend/src/pages/bookings/repairs/RepairRequestPage.tsx": "Form for submitting a repair request with type, details, address, time, and computed price, then creating the booking.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with hero section, service listings, and steps overview using navigation and UI components.",
  "frontend/src/pages/provider/ProviderDashboardPage.tsx": "Provider dashboard showing profile and assigned bookings, with ability to update booking status.",
  "frontend/src/pages/provider/ProviderOnboardingPage.tsx": "Form for providers to register by entering personal info, service areas, and offered services.",
  "frontend/src/pages/rentals/RentalItemDetailPage.tsx": "Shows rental item details including pricing and availability, with navigation back to the catalog.",
  "frontend/src/pages/rentals/RentalsCatalogPage.tsx": "Displays the rental catalog with search, category filtering, and item availability indicators.",
  "frontend/src/pages/services/MobileOpticianPage.tsx": "Shows details about the mobile optician service, listing features and offering a booking CTA.",
  "frontend/src/pages/services/RentalsPage.tsx": "Introduces the eyewear rental service with benefits, visuals, and navigation to the catalog.",
  "frontend/src/pages/services/RepairsPage.tsx": "Describes repair services offered, lists available fixes, and provides a booking button.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend styling system.",
  "project_state.json": "Describes the Eyegic project’s current state, architecture notes, known UI/logo issues, and active features for an on-demand eyewear services marketplace. Indicates this snapshot is a fix request with details on layout, logo, and hero-section problems."
}