{
  "backend/main.mo": "Defines the main actor with booking, provider, rental, and user profile types plus storage maps and authorization/storage mixins.",
  "backend/migration.mo": "Implements migration logic converting old actor state types into updated provider and user profile structures.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides short descriptions of various frontend files and their responsibilities.",
  "frontend/index.css": "Sets Tailwind base layers and CSS variables for theming in light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the root React app.",
  "frontend/src/App.tsx": "Configures the React router, query client, and routes for all service, booking, provider, profile, and rental pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied message with an icon and a button to return home.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/auth/RequireLogin.tsx": "Wraps content and shows a login prompt card when the user is not authenticated.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Shows a styled badge representing a booking's status based on predefined variants.",
  "frontend/src/components/brand/BrandLogo.tsx": "Clickable EYEGIC logo component with adjustable styling variants.",
  "frontend/src/components/forms/AvailabilitySelector.tsx": "Selects single or ranged dates with time inputs and outputs a formatted availability string.",
  "frontend/src/components/forms/MockOtpVerification.tsx": "Mock OTP flow for phone or email, including generating, verifying, resending, and showing status.",
  "frontend/src/components/forms/OptionalPhotoUpload.tsx": "Optional image upload with preview and remove controls, emitting selected file changes.",
  "frontend/src/components/icons/WhatsAppIcon.tsx": "SVG component rendering a WhatsApp icon.",
  "frontend/src/components/layout/PageLayout.tsx": "Page wrapper providing configurable max-width and optional title/description header.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, navigation links, contact buttons, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation, contact options, authentication buttons, and profile completion display.",
  "frontend/src/components/profile/FrameShapeIcons.tsx": "Exports SVG icon components for various eyeglass frame shapes.",
  "frontend/src/components/profile/FrameShapePicker.tsx": "Renders a checkbox list of frame shape options using icons and manages selection state.",
  "frontend/src/hooks/bookings/useBooking.ts": "Fetches a single booking by ID using react-query and the actor API.",
  "frontend/src/hooks/bookings/useCreateOpticianBooking.ts": "Creates an optician booking and invalidates customer bookings on success.",
  "frontend/src/hooks/bookings/useCreateRentalBooking.ts": "Creates a rental booking and invalidates customer bookings on success.",
  "frontend/src/hooks/bookings/useCreateRepairBooking.ts": "Creates a repair booking and invalidates customer bookings on success.",
  "frontend/src/hooks/bookings/useCustomerBookings.ts": "Retrieves bookings for the current customer using the actor API.",
  "frontend/src/hooks/bookings/useProviderBookings.ts": "Retrieves bookings assigned to a provider using react-query.",
  "frontend/src/hooks/bookings/useUpdateBookingStatus.ts": "Updates the status of a booking and refreshes related booking queries.",
  "frontend/src/hooks/branding/useSiteLogo.ts": "Empty placeholder file for site logo hook.",
  "frontend/src/hooks/profile/useCallerUserProfile.ts": "Fetches the caller's user profile with loading state tied to actor readiness.",
  "frontend/src/hooks/profile/useProfileCompletion.ts": "Gets the user profile completion percentage from the backend.",
  "frontend/src/hooks/profile/useProfilePictures.ts": "Provides mutations to update profile and prescription pictures and refresh profile data.",
  "frontend/src/hooks/profile/useSaveCallerUserProfile.ts": "Saves the caller's user profile and invalidates profile-related queries.",
  "frontend/src/hooks/provider/useProvider.ts": "Fetches provider details for the authenticated identity.",
  "frontend/src/hooks/rentals/useRentalCatalog.ts": "Loads the rental catalog items from the backend.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider for managing Internet Identity authentication, including loading, login, logout, and status handling.",
  "frontend/src/index.css": "Tailwind CSS setup defining global styles, theme variables, and utility classes for layout and form components.",
  "frontend/src/main.tsx": "Application entry point that mounts React, wraps the app with QueryClient and InternetIdentity providers, and loads global styles.",
  "frontend/src/pages/bookings/BookingDetailPage.tsx": "Booking detail page that fetches a specific booking and displays its information, status, and related metadata.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingConfirmationPage.tsx": "Displays confirmation details for a mobile optician booking, handles loading and missing booking states.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingPage.tsx": "Form page to create a mobile optician booking with service selection, validation, pricing, and submission.",
  "frontend/src/pages/bookings/MyBookingsPage.tsx": "Lists the logged‑in user's bookings with status, scheduling, and navigation to individual booking details.",
  "frontend/src/pages/bookings/rentals/RentalBookingConfirmationPage.tsx": "Shows confirmed rental booking details with pricing breakdown and navigation options.",
  "frontend/src/pages/bookings/rentals/RentalBookingPage.tsx": "Form to book an eyewear rental, selecting rental duration, address, and submitting to create a booking.",
  "frontend/src/pages/bookings/repairs/RepairRequestConfirmationPage.tsx": "Displays confirmation and details of a repair request, including service fee and booking status.",
  "frontend/src/pages/bookings/repairs/RepairRequestPage.tsx": "Form for submitting an eyewear repair request with optional details, photo, and preferred date.",
  "frontend/src/pages/HomePage.tsx": "Home page UI displaying hero content, service listings, and a how‑it‑works section with navigation actions.",
  "frontend/src/pages/profile/MyProfilePage.tsx": "User profile edit page handling personal info, frame preferences, and uploading profile or prescription pictures.",
  "frontend/src/pages/provider/ProviderDashboardPage.tsx": "Provider dashboard showing provider info, booking list, and allowing booking status updates.",
  "frontend/src/pages/provider/ProviderOnboardingPage.tsx": "Provider registration form with validation, service selection, and phone/email verification.",
  "frontend/src/pages/rentals/RentalItemDetailPage.tsx": "Displays details for a rental item including pricing, availability, and product features.",
  "frontend/src/pages/rentals/RentalsCatalogPage.tsx": "Rental catalog page with search, category filtering, and item list navigation.",
  "frontend/src/pages/services/MobileOpticianPage.tsx": "Marketing page describing mobile optician services with features and booking button.",
  "frontend/src/pages/services/RentalsPage.tsx": "React page showing eyewear rental features, benefits, and a button to navigate to the rentals catalog.",
  "frontend/src/pages/services/RepairsPage.tsx": "React page highlighting repair services, listing service types, and linking to the repair booking flow.",
  "frontend/src/pages/settings/BrandingLogoPage.tsx": "Empty file placeholder for branding logo settings page.",
  "frontend/src/utils/currency.ts": "Provides INR formatting helpers with and without a trailing slash.",
  "frontend/src/utils/logoDataUrl.ts": "Empty utility file intended for logo data URL handling.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/src/utils/validation.ts": "Validation helpers for phone numbers, email, and PIN code formatting with normalization.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project state metadata describing features, requirements, and current app status."
}