{
  "backend/main.mo": "Defines booking, provider, rental, and user profile types with compare helpers, manages in‑memory maps, and exposes profile CRUD with access control.",
  "feature_evidence.json": "Lists feature evidence entries mapping branding‑related feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files describing branding changes, pages, components, and utilities.",
  "frontend/index.css": "Sets Tailwind base variables and dark‑mode theme values and applies global background, text, and border styles.",
  "frontend/index.html": "Basic HTML shell defining the root element and loading the main React entry script.",
  "frontend/src/App.tsx": "Configures the application layout and routing for all pages including services, bookings, rentals, and provider flows.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied message with an icon and a button returning users to the home page.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading handling and query cache reset on logout.",
  "frontend/src/components/auth/RequireLogin.tsx": "Wraps protected content and prompts unauthenticated users with a login card using Internet Identity.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Renders a status badge by mapping backend booking statuses to label/variant pairs.",
  "frontend/src/components/brand/BrandLogo.tsx": "Renders a text‑only EYEGIC brand mark as a link with responsive sizing for header or default variants.",
  "frontend/src/components/forms/OptionalPhotoUpload.tsx": "No summary available.",
  "frontend/src/components/layout/PageLayout.tsx": "No summary available.",
  "frontend/src/components/layout/SiteFooter.tsx": "No summary available.",
  "frontend/src/components/layout/SiteHeader.tsx": "No summary available.",
  "frontend/src/hooks/bookings/useBooking.ts": "No summary available.",
  "frontend/src/hooks/bookings/useCreateOpticianBooking.ts": "No summary available.",
  "frontend/src/hooks/bookings/useCreateRentalBooking.ts": "No summary available.",
  "frontend/src/hooks/bookings/useCreateRepairBooking.ts": "No summary available.",
  "frontend/src/hooks/bookings/useCustomerBookings.ts": "No summary available.",
  "frontend/src/hooks/bookings/useProviderBookings.ts": "No summary available.",
  "frontend/src/hooks/bookings/useUpdateBookingStatus.ts": "No summary available.",
  "frontend/src/hooks/branding/useSiteLogo.ts": "No summary available.",
  "frontend/src/hooks/provider/useProvider.ts": "No summary available.",
  "frontend/src/hooks/rentals/useRentalCatalog.ts": "No summary available.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/index.css": "Tailwind setup defining theme variables, light/dark modes, and utility classes including container and spacing components.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, rendering the main App component.",
  "frontend/src/pages/bookings/BookingDetailPage.tsx": "Displays detailed booking information with status, address, time, and error/loading states.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingConfirmationPage.tsx": "Shows confirmation details for a mobile optician booking including status, reference, and summary fields.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingPage.tsx": "Form for creating a mobile optician booking with service selection, details input, pricing calculation, and submission.",
  "frontend/src/pages/bookings/MyBookingsPage.tsx": "Lists the user's bookings with status, basic details, and navigation to booking detail pages.",
  "frontend/src/pages/bookings/rentals/RentalBookingConfirmationPage.tsx": "Displays a confirmation page for a completed rental booking, showing booking details, pricing, and navigation options.",
  "frontend/src/pages/bookings/rentals/RentalBookingPage.tsx": "Lets users book a rental item by selecting rental days and address, calculates price, and submits a booking.",
  "frontend/src/pages/bookings/repairs/RepairRequestConfirmationPage.tsx": "Shows confirmation for a submitted repair request with booking details and navigation buttons.",
  "frontend/src/pages/bookings/repairs/RepairRequestPage.tsx": "Allows users to submit a repair request with issue type, details, address, time, and optional photo, calculating price before submission.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, service list, and process steps with navigation to service routes.",
  "frontend/src/pages/provider/ProviderDashboardPage.tsx": "Provider dashboard showing provider profile and service bookings with the ability to update booking statuses.",
  "frontend/src/pages/provider/ProviderOnboardingPage.tsx": "Form for new providers to register by entering personal info, service areas, availability, and offered services.",
  "frontend/src/pages/rentals/RentalItemDetailPage.tsx": "Displays detailed rental item info, pricing, availability, and features, with loading and not-found handling.",
  "frontend/src/pages/rentals/RentalsCatalogPage.tsx": "Shows a searchable, filterable catalog of rental items with category filtering and navigation to item details.",
  "frontend/src/pages/services/MobileOpticianPage.tsx": "Presents the mobile optician service overview, features, and booking navigation.",
  "frontend/src/pages/services/RentalsPage.tsx": "Introduces the eyewear rentals service, highlighting benefits and linking to the rental catalog.",
  "frontend/src/pages/services/RepairsPage.tsx": "Describes repair services offered, showcases service features, and links to the repair booking page.",
  "frontend/src/pages/settings/BrandingLogoPage.tsx": "Empty file.",
  "frontend/src/utils/logoDataUrl.ts": "Empty file.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL parameters with session persistence and hash routing support.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom color variables, container settings, extended animations, shadows, and plugins.",
  "project_state.json": "Stores project state and requirements for removing all logo images and replacing branding with bold EYEGIC text across the app."
}