{
  "backend/main.mo": "Defines core types for bookings, providers, rentals, and user profiles with compare helpers and in‑memory maps for storage.",
  "backend/migration.mo": "Migration module converting an older actor state to a newer structure by adding verification logs and preserving existing maps.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base layer defining CSS variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "HTML entry file providing root container and loading the main React module.",
  "frontend/src/App.tsx": "Sets up all application routes using TanStack Router, mapping services, bookings, rentals, profile, provider, and admin pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Admin‑only access denied screen showing a warning and link back to home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with automatic session handling and UI feedback.",
  "frontend/src/components/auth/RequireLogin.tsx": "Wrapper component that prompts unauthenticated users to log in before accessing protected content.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Renders a badge with label and variant based on booking status from the backend.",
  "frontend/src/components/brand/BrandLogo.tsx": "Renders a clickable EYEGIC logo linking to home with size/style variants for header or default.",
  "frontend/src/components/forms/AvailabilitySelector.tsx": "Provides date or date-range selection with time inputs and outputs a formatted availability string.",
  "frontend/src/components/forms/MobileNumberOtpGate.tsx": "Handles 10‑digit phone input, OTP sending, verification, and triggers a submit callback once verified.",
  "frontend/src/components/forms/MockOtpVerification.tsx": "Simulates a 4‑digit OTP flow with mock generation, validation, resend, and verification UI.",
  "frontend/src/components/forms/OptionalPhotoUpload.tsx": "Allows optional image upload with preview and removal, notifying parent of file changes.",
  "frontend/src/components/forms/RepairIssueTypeMultiSelect.tsx": "Renders checkboxes for selecting multiple repair issue types and updates the selected list.",
  "frontend/src/components/icons/WhatsAppIcon.tsx": "SVG component rendering the WhatsApp logo with customizable styling.",
  "frontend/src/components/layout/header/AdminNotificationsControl.tsx": "Notification bell showing pending admin verifications and navigating to the notifications page.",
  "frontend/src/components/layout/header/MyProfileControl.tsx": "Profile button showing completion percentage and linking to the profile page.",
  "frontend/src/components/layout/PageLayout.tsx": "Defines a generic page layout with optional title/description and configurable max-width.",
  "frontend/src/components/layout/RootLayout.tsx": "Wraps the app with header, footer, and an Outlet for routed content.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays footer with navigation links, contact actions, branding, and build info.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header component handling navigation, login/logout, admin controls, and mobile menu.",
  "frontend/src/components/profile/FrameShapeIcons.tsx": "SVG icon components representing different eyewear frame shapes.",
  "frontend/src/components/profile/FrameShapePicker.tsx": "Frame shape selection UI using checkboxes and corresponding icons.",
  "frontend/src/config/buildInfo.ts": "Exports build identifier from environment variables.",
  "frontend/src/hooks/admin/useMobileNumberVerifications.ts": "Fetches mobile number verification logs via actor API.",
  "frontend/src/hooks/auth/useIsCallerAdmin.ts": "Checks whether the current caller is an admin via actor API.",
  "frontend/src/hooks/bookings/useBooking.ts": "Fetches a single booking by ID using actor.",
  "frontend/src/hooks/bookings/useCreateOpticianBooking.ts": "Creates a mobile optician booking and invalidates customer bookings cache.",
  "frontend/src/hooks/bookings/useCreateRentalBooking.ts": "Creates a rental booking and invalidates customer bookings cache.",
  "frontend/src/hooks/bookings/useCreateRepairBooking.ts": "Creates a repair booking and refreshes related booking queries.",
  "frontend/src/hooks/bookings/useCustomerBookings.ts": "Fetches all bookings for the current customer.",
  "frontend/src/hooks/bookings/useGetBooking.ts": "Alternate hook for fetching a single booking by ID.",
  "frontend/src/hooks/bookings/useLogMobileNumberVerification.ts": "Logs a mobile number verification event via actor.",
  "frontend/src/hooks/bookings/useProviderBookings.ts": "Fetches bookings assigned to the current provider.",
  "frontend/src/hooks/bookings/useUpdateBookingStatus.ts": "Updates a booking’s status and invalidates related caches.",
  "frontend/src/hooks/branding/useSiteLogo.ts": "Empty placeholder for site logo hook.",
  "frontend/src/hooks/profile/useCallerUserProfile.ts": "Fetches the current user's profile with loading state adjustments.",
  "frontend/src/hooks/profile/useProfileCompletion.ts": "Fetches and normalizes the user's profile completion percentage.",
  "frontend/src/hooks/profile/useProfilePictures.ts": "Mutations for uploading profile and prescription pictures with cache invalidation.",
  "frontend/src/hooks/profile/useSaveCallerUserProfile.ts": "Saves user profile data and updates profile-related caches.",
  "frontend/src/hooks/provider/useProvider.ts": "Fetches provider details for the logged-in identity.",
  "frontend/src/hooks/rentals/useRentalCatalog.ts": "Fetches the catalog of rental items via actor API.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and exposing auth state to the app.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, dark mode values, and shared UI utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminNotificationsPage.tsx": "Admin page showing mobile verification logs, gated by admin access and rendered in a sortable table.",
  "frontend/src/pages/bookings/BookingDetailPage.tsx": "Shows detailed booking information including status, pricing, and service metadata, requiring user login.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingConfirmationPage.tsx": "Shows confirmation details for a mobile optician booking, handling invalid IDs, loading state, and navigation.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingPage.tsx": "Multi‑step form for creating a mobile optician booking, including OTP verification, service selection, and submission.",
  "frontend/src/pages/bookings/MyBookingsPage.tsx": "Displays the logged-in user's bookings with status, schedule, location, and total price, with loading and authentication handling.",
  "frontend/src/pages/bookings/rentals/RentalBookingConfirmationPage.tsx": "Displays confirmation details for a rental booking with pricing breakdown and navigation options.",
  "frontend/src/pages/bookings/rentals/RentalBookingPage.tsx": "Form for creating a rental booking, selecting rental days, entering address, calculating price, and submitting.",
  "frontend/src/pages/bookings/repairs/RepairRequestConfirmationPage.tsx": "Shows confirmation and details for a repair request, handling invalid IDs, loading errors, and requiring login.",
  "frontend/src/pages/bookings/repairs/RepairRequestPage.tsx": "Page for submitting a repair booking with OTP verification, repair type selection, and form details before creating a booking.",
  "frontend/src/pages/HomePage.tsx": "Displays the landing page with services, handles mobile OTP verification, and navigates users to service flows.",
  "frontend/src/pages/profile/MyProfilePage.tsx": "User profile page allowing editing personal info, frame preferences, and uploading profile and prescription pictures.",
  "frontend/src/pages/provider/ProviderDashboardPage.tsx": "Provider dashboard showing provider info, upcoming bookings, and tools for updating booking statuses.",
  "frontend/src/pages/provider/ProviderOnboardingPage.tsx": "Provider onboarding form collecting personal details, service areas, availability, and required verifications.",
  "frontend/src/pages/rentals/RentalItemDetailPage.tsx": "Rental item detail page displaying item info, availability, pricing, and navigation back to the rental catalog.",
  "frontend/src/pages/rentals/RentalsCatalogPage.tsx": "Displays the rental catalog with search and category filtering and lists items with availability status.",
  "frontend/src/pages/services/MobileOpticianPage.tsx": "Shows details of the mobile optician service with features and a booking button.",
  "frontend/src/pages/services/RentalsPage.tsx": "Intro page explaining eyewear rentals with benefits, imagery, and navigation to the catalog.",
  "frontend/src/pages/services/RepairsPage.tsx": "Describes eyewear repair services, lists available repairs, and links to booking.",
  "frontend/src/pages/settings/BrandingLogoPage.tsx": "Empty file with no implementation.",
  "frontend/src/utils/currency.ts": "Provides utility functions to format INR currency values.",
  "frontend/src/utils/homeOtpSession.ts": "Manages session state for home-flow OTP verification, including set, get, and clear helpers.",
  "frontend/src/utils/logoDataUrl.ts": "Empty file with no implementation.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with session storage support.",
  "frontend/src/utils/validation.ts": "Contains validators for phone numbers, email, and PIN codes along with sanitization helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file defining feature requirements, pending requests, and restoration tasks for admin notifications and profile completion behavior."
}