{
  "backend/main.mo": "Defines the main actor with booking, provider, rental, and user profile types and state, plus authorization‑protected profile getters and setters.",
  "backend/migration.mo": "Implements a migration that drops the old persistent logo field while preserving existing state maps.",
  "feature_evidence.json": "Lists feature evidence entries detailing files and components involved in removing logo rendering and related UI logic.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base/custom CSS defining color variables, themes, and global styling rules.",
  "frontend/index.html": "HTML entry point loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Configures routing and layout for all site pages using TanStack Router with header, footer, and toasts.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen showing an access denied message with an option to return home.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with visual state and query cache clearing.",
  "frontend/src/components/auth/RequireLogin.tsx": "Wrapper component that shows a login prompt unless the user is authenticated.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Renders a status badge based on booking status with predefined labels and variants.",
  "frontend/src/components/brand/BrandLogo.tsx": "Empty file with no implementation.",
  "frontend/src/components/forms/OptionalPhotoUpload.tsx": "Provides an optional image upload component with preview and remove functionality.",
  "frontend/src/components/layout/PageLayout.tsx": "Wraps pages with configurable max-width and optional title and description headers.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays site footer with navigation links, branding, and dynamic year attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders site header with navigation, mobile menu, and login-related actions.",
  "frontend/src/hooks/bookings/useBooking.ts": "Fetches a single booking by ID using react-query and the actor API.",
  "frontend/src/hooks/bookings/useCreateOpticianBooking.ts": "Creates an optician booking and invalidates customer booking queries on success.",
  "frontend/src/hooks/bookings/useCreateRentalBooking.ts": "Creates a rental booking and refreshes customer bookings on success.",
  "frontend/src/hooks/bookings/useCreateRepairBooking.ts": "Creates a repair booking and invalidates customer booking data upon completion.",
  "frontend/src/hooks/bookings/useCustomerBookings.ts": "Retrieves all bookings for the current customer via the actor API.",
  "frontend/src/hooks/bookings/useProviderBookings.ts": "Fetches provider-related bookings when an actor is available.",
  "frontend/src/hooks/bookings/useUpdateBookingStatus.ts": "Updates a booking’s status and invalidates related queries after mutation.",
  "frontend/src/hooks/branding/useSiteLogo.ts": "Empty file with no implementation.",
  "frontend/src/hooks/provider/useProvider.ts": "Fetches provider data tied to the current identity and offers a provider onboarding mutation.",
  "frontend/src/hooks/rentals/useRentalCatalog.ts": "Loads the rental item catalog using the actor API.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing identity load, login, and state.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes, plus utility classes for layout spacing.",
  "frontend/src/main.tsx": "Sets up React root rendering with React Query and Internet Identity providers, loading the main App component.",
  "frontend/src/pages/bookings/BookingDetailPage.tsx": "Displays detailed booking information with status, metadata, and navigation, handling loading and error states.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingConfirmationPage.tsx": "Presents booking confirmation details for a mobile optician service, including status and cost summary.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingPage.tsx": "Provides a form to create a mobile optician booking, calculates pricing, and submits data via a booking hook.",
  "frontend/src/pages/bookings/MyBookingsPage.tsx": "Shows the logged‑in user’s bookings with status badges, schedule info, and links to detail pages.",
  "frontend/src/pages/bookings/rentals/RentalBookingConfirmationPage.tsx": "Displays confirmation details for a completed rental booking, loading booking data and showing status, fees, and navigation actions.",
  "frontend/src/pages/bookings/rentals/RentalBookingPage.tsx": "Handles creating a rental booking by selecting rental days and address, calculating price, and submitting the booking.",
  "frontend/src/pages/bookings/repairs/RepairRequestConfirmationPage.tsx": "Shows confirmation and details for a submitted repair request, including status, repair info, and navigation options.",
  "frontend/src/pages/bookings/repairs/RepairRequestPage.tsx": "Provides a form to submit a repair request with issue type, details, address, preferred time, and optional photo, then creates a booking.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, service listings, and a how‑it‑works flow using navigation and UI components.",
  "frontend/src/pages/provider/ProviderDashboardPage.tsx": "Provider dashboard showing profile info, provider bookings, and tools to update booking statuses.",
  "frontend/src/pages/provider/ProviderOnboardingPage.tsx": "Form for new providers to register by entering personal info, service areas, and offered services.",
  "frontend/src/pages/rentals/RentalItemDetailPage.tsx": "Displays details for a single rental item, including availability, pricing, and features, with loading and not-found states.",
  "frontend/src/pages/rentals/RentalsCatalogPage.tsx": "Shows a searchable and filterable catalog of rental items with category selection and availability indicators.",
  "frontend/src/pages/services/MobileOpticianPage.tsx": "Presents information about the mobile optician service with features and a booking button.",
  "frontend/src/pages/services/RentalsPage.tsx": "Explains eyewear rental benefits and features, linking users to the rental catalog.",
  "frontend/src/pages/services/RepairsPage.tsx": "Describes repair services offered, including a service list and a booking option.",
  "frontend/src/pages/settings/BrandingLogoPage.tsx": "Empty file with no implementation.",
  "frontend/src/utils/logoDataUrl.ts": "Empty file with no implementation.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, extended theme options, and animation keyframes using typography, container-queries, and animate plugins.",
  "project_state.json": "Project state describing versions, features, and pending requests focused on removing all logo-related UI, assets, and backend logic."
}