{
  "backend/main.mo": "Defines booking, provider, rental, and user profile types with comparison modules and initializes storage maps for a canister backend.",
  "feature_evidence.json": "Describes feature evidence for UI restoration and route‑based visibility with referenced files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for documentation or build planning.",
  "frontend/index.css": "Sets Tailwind base styles and CSS variables for light and dark themes using custom color tokens.",
  "frontend/index.html": "Minimal HTML entry point mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines all application routes using TanStack Router and maps them to page components.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Renders an admin‑only access denied card with a home redirect button.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout button handling Internet Identity auth state and errors.",
  "frontend/src/components/auth/RequireLogin.tsx": "Gatekeeper component that shows a login prompt when the user is not authenticated.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Maps booking statuses to labeled UI badges with variant styling.",
  "frontend/src/components/brand/BrandLogo.tsx": "Clickable EYEGIC text logo component with header and default size variants.",
  "frontend/src/components/forms/AvailabilitySelector.tsx": "Provides a date picker supporting single or range selection with time inputs and outputs a formatted availability string.",
  "frontend/src/components/forms/MobileNumberOtpGate.tsx": "Handles mobile number input, validation, OTP sending flow, and submission once verified.",
  "frontend/src/components/forms/MockOtpVerification.tsx": "Implements a mock 4-digit OTP flow with generation, input, verification, and resend support.",
  "frontend/src/components/forms/OptionalPhotoUpload.tsx": "Allows optional image upload with preview and removal, reporting the file to a parent component.",
  "frontend/src/components/forms/RepairIssueTypeMultiSelect.tsx": "Renders checkboxes for selecting multiple repair issue types and updates the parent on changes.",
  "frontend/src/components/icons/WhatsAppIcon.tsx": "SVG component rendering the WhatsApp logo.",
  "frontend/src/components/layout/header/AdminNotificationsControl.tsx": "Shows admin notification count and navigates to notifications page on click.",
  "frontend/src/components/layout/header/MyProfileControl.tsx": "Displays profile navigation button with completion percentage for authenticated users.",
  "frontend/src/components/layout/PageLayout.tsx": "Page wrapper that applies max-width, optional title/description, and layout spacing.",
  "frontend/src/components/layout/RootLayout.tsx": "Top-level layout including header, footer, and routed page outlet.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with links, contact actions, branding, and build identifier display.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header component with navigation, auth controls, contact menu, and mobile menu handling.",
  "frontend/src/components/profile/FrameShapeIcons.tsx": "Exports a set of SVG icons representing various eyeglass frame shapes.",
  "frontend/src/components/profile/FrameShapePicker.tsx": "Checkbox-based picker allowing users to select multiple eyeglass frame shapes.",
  "frontend/src/config/buildInfo.ts": "Defines the build identifier shown in the UI.",
  "frontend/src/hooks/admin/useMobileNumberVerifications.ts": "Fetches mobile number verification logs via actor API.",
  "frontend/src/hooks/auth/useIsCallerAdmin.ts": "Checks whether the current caller has admin privileges.",
  "frontend/src/hooks/bookings/useBooking.ts": "Retrieves a booking by ID using actor API.",
  "frontend/src/hooks/bookings/useCreateOpticianBooking.ts": "Creates an optician booking and invalidates customer bookings cache.",
  "frontend/src/hooks/bookings/useCreateRentalBooking.ts": "Creates a rental booking and refreshes customer bookings.",
  "frontend/src/hooks/bookings/useCreateRepairBooking.ts": "Creates a repair booking and invalidates related booking queries.",
  "frontend/src/hooks/bookings/useCustomerBookings.ts": "Fetches all bookings for the current customer.",
  "frontend/src/hooks/bookings/useGetBooking.ts": "Another hook for fetching a booking by ID via actor API.",
  "frontend/src/hooks/bookings/useLogMobileNumberVerification.ts": "Logs a mobile number verification event using the actor.",
  "frontend/src/hooks/bookings/useProviderBookings.ts": "Fetches bookings assigned to the current provider.",
  "frontend/src/hooks/bookings/useUpdateBookingStatus.ts": "Updates a booking's status and invalidates booking-related caches.",
  "frontend/src/hooks/branding/useSiteLogo.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/profile/useCallerUserProfile.ts": "Fetches the current user's profile and exposes loading helpers.",
  "frontend/src/hooks/profile/useProfileCompletion.ts": "Retrieves and normalizes the user's profile completion percentage.",
  "frontend/src/hooks/profile/useProfilePictures.ts": "Mutations for updating profile and prescription pictures and refreshing profile data.",
  "frontend/src/hooks/profile/useSaveCallerUserProfile.ts": "Saves the caller's user profile and invalidates profile-related queries.",
  "frontend/src/hooks/provider/useProvider.ts": "Loads provider data for the authenticated identity and offers provider onboarding.",
  "frontend/src/hooks/rentals/useRentalCatalog.ts": "Fetches the list of available rental items.",
  "frontend/src/hooks/routing/useIsHomeRoute.ts": "Returns true if the current route path is the home route.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and auth-client configuration.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables, dark mode styles, and reusable component utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/pages/admin/AdminNotificationsPage.tsx": "Displays admin-only mobile number verification logs with loading and access control states.",
  "frontend/src/pages/bookings/BookingDetailPage.tsx": "Shows detailed booking information with type labels, pricing, and loading/error handling.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingConfirmationPage.tsx": "Shows confirmation details for a mobile optician booking, handling invalid or missing booking IDs and loading states.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingPage.tsx": "Multi‑step form for creating a mobile optician booking, including OTP verification, service selection, and submission.",
  "frontend/src/pages/bookings/MyBookingsPage.tsx": "Displays the logged‑in user's bookings with status, schedule, address, and total price, using cards and a loading state.",
  "frontend/src/pages/bookings/rentals/RentalBookingConfirmationPage.tsx": "Displays confirmation and payment breakdown for a completed rental booking, with options to return home or view bookings.",
  "frontend/src/pages/bookings/rentals/RentalBookingPage.tsx": "Form to create a rental booking for a selected item, calculating price based on rental days and submitting booking details.",
  "frontend/src/pages/bookings/repairs/RepairRequestConfirmationPage.tsx": "Shows confirmation details of a repair request, handling invalid IDs, errors, and booking status display.",
  "frontend/src/pages/bookings/repairs/RepairRequestPage.tsx": "Multi‑step repair request form with OTP verification, repair details, and booking submission using createRepairBooking.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with services, OTP verification flow, and navigation to service pages.",
  "frontend/src/pages/profile/MyProfilePage.tsx": "User profile editor supporting personal info, frame preferences, and profile/prescription picture upload and preview.",
  "frontend/src/pages/provider/ProviderDashboardPage.tsx": "Provider dashboard showing profile details, bookings, and allowing booking status updates.",
  "frontend/src/pages/provider/ProviderOnboardingPage.tsx": "Provider onboarding form handling verification, service selection, availability, and submission validation.",
  "frontend/src/pages/rentals/RentalItemDetailPage.tsx": "Displays rental item details with availability, pricing, and navigation back to the catalog.",
  "frontend/src/pages/rentals/RentalsCatalogPage.tsx": "A catalog page that loads rental items, applies search and category filters, and displays item cards with availability.",
  "frontend/src/pages/services/MobileOpticianPage.tsx": "A service page describing the mobile optician offering with features, imagery, and a booking button.",
  "frontend/src/pages/services/RentalsPage.tsx": "A promotional page explaining eyewear rentals, highlighting benefits, and linking to the rental catalog.",
  "frontend/src/pages/services/RepairsPage.tsx": "A service page listing available eyewear repair services with visuals and a button to book repairs.",
  "frontend/src/pages/settings/BrandingLogoPage.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/utils/currency.ts": "Provides helper functions to format numbers as INR currency strings.",
  "frontend/src/utils/homeOtpSession.ts": "Manages sessionStorage state for home-flow OTP verification and associated mobile numbers.",
  "frontend/src/utils/logoDataUrl.ts": "Empty utility file with no implementation.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/src/utils/validation.ts": "Validation helpers for phone numbers, emails, and PIN codes along with sanitization functions.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, content paths, extended color themes, custom border radii, shadows, and animation keyframes.",
  "project_state.json": "Defines project metadata, known UI issues, existing features, and a pending request to restore missing header icons."
}