{
  "backend/main.mo": "Motoko canister defining booking, provider, rental, and user profile types with map‑based state and access‑controlled profile queries and updates.",
  "feature_evidence.json": "Feature evidence report linking feature requests to affected frontend files and components with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend pages, components, and updated logo usage.",
  "frontend/index.css": "Global Tailwind layer defining CSS variables for light/dark themes and applying base background and border styles.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the application layout and configures all routes for services, bookings, rentals, and provider pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Card-based access denied screen with an alert icon and navigation back to home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/RequireLogin.tsx": "Wrapper enforcing authentication and showing a login prompt when the user is not signed in.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Renders a status badge mapped from backend booking statuses to label and variant styles.",
  "frontend/src/components/brand/BrandLogo.tsx": "Displays the new Eyegic logo asset with size variants and non-shrinking layout behavior.",
  "frontend/src/components/forms/OptionalPhotoUpload.tsx": "Optional photo upload component with preview, removal, and callback support.",
  "frontend/src/components/layout/PageLayout.tsx": "A layout wrapper that renders page content with optional title and description and configurable max-width classes.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays the site footer with navigation links, company info, and a dynamic copyright line.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the responsive site header with navigation links, login controls, and a mobile menu sheet.",
  "frontend/src/hooks/bookings/useBooking.ts": "Fetches a single booking by ID using the actor and react-query.",
  "frontend/src/hooks/bookings/useCreateOpticianBooking.ts": "Mutation hook to create an optician booking and invalidate customer bookings afterward.",
  "frontend/src/hooks/bookings/useCreateRentalBooking.ts": "Mutation hook to create a rental booking and refresh customer bookings on success.",
  "frontend/src/hooks/bookings/useCreateRepairBooking.ts": "Mutation hook that submits a repair booking and invalidates customer bookings.",
  "frontend/src/hooks/bookings/useCustomerBookings.ts": "Retrieves all customer bookings via the actor with react-query.",
  "frontend/src/hooks/bookings/useProviderBookings.ts": "Loads bookings assigned to a provider using react-query.",
  "frontend/src/hooks/bookings/useUpdateBookingStatus.ts": "Mutation hook to update a booking’s status and invalidate related booking queries.",
  "frontend/src/hooks/provider/useProvider.ts": "Fetches provider details tied to the current identity and provides a mutation to onboard new providers.",
  "frontend/src/hooks/rentals/useRentalCatalog.ts": "Retrieves the rental item catalog through the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login handling, and stored identity restoration via a context provider.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode tokens, and custom layout utilities.",
  "frontend/src/main.tsx": "Initializes React, sets up QueryClient and InternetIdentityProvider, and renders the app.",
  "frontend/src/pages/bookings/BookingDetailPage.tsx": "Displays detailed information for a specific booking, including type, status, address, time, and related metadata.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingConfirmationPage.tsx": "Shows confirmation details for a mobile optician booking, including service info, address, time, and total price.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingPage.tsx": "Form for creating a mobile optician booking with service selection, address, preferred time, and price calculation.",
  "frontend/src/pages/bookings/MyBookingsPage.tsx": "Lists all bookings for the logged‑in customer with status, schedule, and navigation to detail pages.",
  "frontend/src/pages/bookings/rentals/RentalBookingConfirmationPage.tsx": "Displays confirmation details for an eyewear rental booking including rental info, delivery address, and payment breakdown.",
  "frontend/src/pages/bookings/rentals/RentalBookingPage.tsx": "Handles rental booking creation, including form inputs for days and address, price calculation, and submission via createRentalBooking.",
  "frontend/src/pages/bookings/repairs/RepairRequestConfirmationPage.tsx": "Displays repair booking confirmation with booking details, status, and navigation options.",
  "frontend/src/pages/bookings/repairs/RepairRequestPage.tsx": "Form for submitting a repair request, collecting issue details, address, time, optional photo, and sending createRepairBooking.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, service cards, and steps explaining how the eyewear services work.",
  "frontend/src/pages/provider/ProviderDashboardPage.tsx": "Provider dashboard showing provider profile, bookings list, and ability to update booking status.",
  "frontend/src/pages/provider/ProviderOnboardingPage.tsx": "Form for providers to register by entering personal info, service areas, and offered services.",
  "frontend/src/pages/rentals/RentalItemDetailPage.tsx": "Shows rental item details, pricing, availability, and navigation to the rental catalog.",
  "frontend/src/pages/rentals/RentalsCatalogPage.tsx": "Renders a rental catalog page with search and category filtering, listing items fetched from useRentalCatalog. Displays item availability and navigates to item details.",
  "frontend/src/pages/services/MobileOpticianPage.tsx": "Shows the mobile optician service overview with features, imagery, and a button to book the service. Includes supporting feature cards.",
  "frontend/src/pages/services/RentalsPage.tsx": "Presents an overview of the eyewear rentals service with benefits, imagery, and a link to browse the rental catalog. Includes highlight cards for delivery, selection, and returns.",
  "frontend/src/pages/services/RepairsPage.tsx": "Displays eyewear repair services with a list of service options, imagery, and a button to request repairs. Includes cards highlighting convenience, speed, and expertise.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Defines project state, architecture notes, known UI issues, required images, and existing features for the Eyegic on‑demand eyewear marketplace. Serves as a fix request outlining logo, hero layout, and rentals tab problems."
}