{
  "backend/main.mo": "Defines booking, provider, rental, and user profile types with comparison helpers and initializes related Maps with authorization and storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptive summaries of various frontend files for reference or documentation purposes.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for themes and applying global background, text, and border styles.",
  "frontend/index.html": "Basic HTML entry point containing a root div and script loading the main frontend bundle.",
  "frontend/src/App.tsx": "Configures TanStack Router with RootLayout and all application routes, wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied card with an alert icon and a button to return home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with status handling and React Query cache clearing.",
  "frontend/src/components/auth/RequireLogin.tsx": "Wrapper that prompts users to log in before rendering protected content.",
  "frontend/src/components/bookings/BookingStatusBadge.tsx": "Renders a visual badge for each booking status with predefined labels and variants.",
  "frontend/src/components/brand/BrandLogo.tsx": "Renders the EYEGIC text logo with optional sizing variants and link behavior.",
  "frontend/src/components/forms/AvailabilitySelector.tsx": "UI component for selecting single or ranged dates with time inputs and emitting a formatted availability string.",
  "frontend/src/components/forms/MockOtpVerification.tsx": "Simulates OTP sending and verification with mock codes, input handling, and success/error states.",
  "frontend/src/components/forms/OptionalPhotoUpload.tsx": "Optional image uploader that previews selected photos and allows removing or replacing the file.",
  "frontend/src/components/icons/WhatsAppIcon.tsx": "Renders an SVG WhatsApp icon with customizable className.",
  "frontend/src/components/layout/PageLayout.tsx": "Page wrapper providing max‑width layout, optional title/description, and standard spacing.",
  "frontend/src/components/layout/RootLayout.tsx": "App root layout containing header, footer, and routed page content via Outlet.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with navigation, contact actions, branding, and build info display.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation links, contact options, authentication controls, and mobile menu.",
  "frontend/src/components/profile/FrameShapeIcons.tsx": "Exports SVG icons representing various eyewear frame shapes.",
  "frontend/src/components/profile/FrameShapePicker.tsx": "Renders a list of frame-shape checkbox options with icons and manages toggling selected shapes.",
  "frontend/src/config/buildInfo.ts": "Exports a build identifier loaded from environment variables with a fallback string.",
  "frontend/src/hooks/bookings/useBooking.ts": "Fetches a single booking by ID using react-query and the actor API.",
  "frontend/src/hooks/bookings/useCreateOpticianBooking.ts": "Creates an optician booking via actor API and invalidates customerBookings on success.",
  "frontend/src/hooks/bookings/useCreateRentalBooking.ts": "Creates a rental booking through the actor and refreshes customerBookings afterward.",
  "frontend/src/hooks/bookings/useCreateRepairBooking.ts": "Creates a repair booking with optional details and invalidates customerBookings.",
  "frontend/src/hooks/bookings/useCustomerBookings.ts": "Loads all bookings belonging to the current customer using react-query.",
  "frontend/src/hooks/bookings/useProviderBookings.ts": "Fetches bookings for the current provider when the actor is ready.",
  "frontend/src/hooks/bookings/useUpdateBookingStatus.ts": "Updates a booking’s status and invalidates provider, customer, and single booking queries.",
  "frontend/src/hooks/branding/useSiteLogo.ts": "Empty file placeholder for site-logo related logic.",
  "frontend/src/hooks/profile/useCallerUserProfile.ts": "Retrieves the logged-in user's profile and exposes loading state adjustments.",
  "frontend/src/hooks/profile/useProfileCompletion.ts": "Queries the actor for numeric profile completion percentage.",
  "frontend/src/hooks/profile/useProfilePictures.ts": "Provides mutations to update profile and prescription pictures and refresh related queries.",
  "frontend/src/hooks/profile/useSaveCallerUserProfile.ts": "Saves the caller's profile via actor API and invalidates profile-related queries.",
  "frontend/src/hooks/provider/useProvider.ts": "Fetches provider info for current identity and provides onboarding mutation.",
  "frontend/src/hooks/rentals/useRentalCatalog.ts": "Loads the rental catalog items from the actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login, logout, and identity loading behavior.",
  "frontend/src/index.css": "Defines Tailwind base styles, theming variables, dark mode, and shared UI utility classes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/bookings/BookingDetailPage.tsx": "Displays full details for a specific booking, including status, service info, address, pricing, and navigation back to the bookings list.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingConfirmationPage.tsx": "Shows confirmation details for a completed mobile optician booking, including service info, address, and total price.",
  "frontend/src/pages/bookings/mobile-optician/MobileOpticianBookingPage.tsx": "Form page for creating a mobile optician booking with service selection, contact details, scheduling, and price calculation.",
  "frontend/src/pages/bookings/MyBookingsPage.tsx": "Lists all bookings for the logged-in customer with status, schedule, pricing, and options to view details.",
  "frontend/src/pages/bookings/rentals/RentalBookingConfirmationPage.tsx": "Displays confirmation details for a rental booking, including rental info, delivery address, and payment breakdown.",
  "frontend/src/pages/bookings/rentals/RentalBookingPage.tsx": "Renders a rental booking form that calculates pricing, validates input, and submits a new rental booking. Handles item lookup, error states, and redirects to a confirmation page.",
  "frontend/src/pages/bookings/repairs/RepairRequestConfirmationPage.tsx": "Displays repair booking confirmation details including status, service info, and pricing. Handles loading, missing booking states, and navigation options.",
  "frontend/src/pages/bookings/repairs/RepairRequestPage.tsx": "Provides a form for submitting repair service requests with optional details, photos, and preferred date. Sends booking data to the backend and redirects to a confirmation page on success.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, service categories, and a how-it-works section with navigation to booking pages.",
  "frontend/src/pages/profile/MyProfilePage.tsx": "Shows and edits user profile data including personal details, preferences, and pictures. Supports uploading, previewing, and saving profile and prescription images.",
  "frontend/src/pages/provider/ProviderDashboardPage.tsx": "Displays provider details and assigned bookings with controls to update booking statuses. Handles login requirements, provider registration flow, and loading states.",
  "frontend/src/pages/provider/ProviderOnboardingPage.tsx": "Implements a multi-step provider onboarding form with validation, service selection, phone/email verification, and submission handling.",
  "frontend/src/pages/rentals/RentalItemDetailPage.tsx": "Displays detailed information for a rental item, including pricing, availability, and service highlights, with loading and not-found states.",
  "frontend/src/pages/rentals/RentalsCatalogPage.tsx": "Shows a searchable and filterable catalog of rental items with category selection and availability indicators.",
  "frontend/src/pages/services/MobileOpticianPage.tsx": "Presents the mobile optician service overview with features, imagery, and navigation to booking.",
  "frontend/src/pages/services/RentalsPage.tsx": "Provides an overview of the eyewear rentals offering with benefits, imagery, and a link to the catalog.",
  "frontend/src/pages/services/RepairsPage.tsx": "Describes available eyewear repair services with feature listing, imagery, and navigation to booking.",
  "frontend/src/pages/settings/BrandingLogoPage.tsx": "Empty file with no implemented content.",
  "frontend/src/utils/currency.ts": "Contains helper functions to format numbers as INR currency strings with and without a slash suffix.",
  "frontend/src/utils/logoDataUrl.ts": "Empty file with no implemented content.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL params (query or hash) and persisting them via sessionStorage, plus helpers for clearing stored or hash parameters.",
  "frontend/src/utils/validation.ts": "Provides validation and sanitization for phone numbers, emails, and PIN codes, including normalization utilities.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths, theming extensions, custom colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Project metadata describing issues, features, and state information for the EYEGIC Bookings project."
}