{
  "kind": "build_request",
  "title": "Remove all logo images and replace header branding with bold “EYEGIC” text across the app",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove all instances of the current logo image (including the header home-link <img> at XPath /html[1]/body[1]/div[1]/div[1]/header[1]/div[1]/div[1]/a[1]/img[1]) across the entire app, so no UI renders the logo image anywhere.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "override that rule and remove this logo everywhere in the app"
        ]
      },
      "acceptanceCriteria": [
        "No rendered <img> in the app uses src \"/assets/generated/EYEGIC LOGO powered by lensdirect.dim_1536x1024.png\".",
        "Header, mobile menu header, and footer no longer display the logo image.",
        "App builds with no unused-import/typecheck errors after removing logo usage."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the header brand logo area with a bold, text-only brand mark that reads exactly \"EYEGIC\", sized as large as possible while still fitting within the header height, and apply this across all pages (including mobile header/menu). The brand mark must remain a link to \"/\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "header will contain EYEGIC text in place of logo in bold format with max font size as possible to fit the header, this change is meant to apply across all the pages"
        ]
      },
      "acceptanceCriteria": [
        "In the desktop header, the left brand element displays bold text \"EYEGIC\" (no logo image) and clicking it navigates to \"/\".",
        "The brand text scales to fit the header height (no vertical overflow/cropping) across responsive breakpoints.",
        "In the mobile menu header area (inside the Sheet), the brand text \"EYEGIC\" is shown instead of an image and still closes the menu on click if previously supported via onClick."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the footer to remove the logo image display and replace it with a text-only \"EYEGIC\" brand mark (or remove the logo area entirely) while keeping the footer layout coherent and accessible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove all instances of this logo across the entire app"
        ]
      },
      "acceptanceCriteria": [
        "The footer no longer renders an <img> for the site logo.",
        "Footer layout remains visually aligned (no broken spacing where the logo image used to be).",
        "No references to useSiteLogo() remain if it becomes unused by removing the image-based logo."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Do not add new authentication providers or change Internet Identity behavior.",
    "Do not introduce new backend canisters/services or external storage.",
    "Do not redesign unrelated pages or change booking/provider functionality beyond removing logo imagery."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}