{
  "kind": "build_request",
  "title": "Fix draft preview not opening and add visible build identifier (Draft 23)",
  "projectName": "EYEGIC Bookings",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the TanStack Router initialization in frontend/src/App.tsx so the app can render without runtime errors (remove the circular dependency where createRootRoute references `router` before it is initialized).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I AM STILL NOT ABLE TO OPEN THE LATEST DRAFT KINDLY FIX THIS"
        ]
      },
      "acceptanceCriteria": [
        "Opening the app shows the Home page instead of a blank screen",
        "The browser console does not show a ReferenceError related to accessing `router` before initialization",
        "All existing routes continue to work (e.g., /, /provider/onboard, /my-profile)"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Eliminate conflicting React Query client setup by ensuring the app uses a single QueryClientProvider (avoid nesting different QueryClientProviders between frontend/src/main.tsx and frontend/src/App.tsx).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "still not able to open"
        ]
      },
      "acceptanceCriteria": [
        "There is only one active QueryClientProvider in the render tree at runtime",
        "React Query hooks continue to function (queries and mutations still execute and cache as expected)"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a visible, user-facing build identifier string that can be set to \"Draft 23\" and is displayed in the UI (e.g., footer or an About area) so it is unambiguous which draft is currently deployed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Deploy draft 23"
        ]
      },
      "acceptanceCriteria": [
        "The UI displays a build identifier that reads \"Draft 23\" when configured to that value",
        "The build identifier is visible without requiring authentication",
        "The build identifier does not require any backend calls to display"
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx unless strictly necessary; prefer composing around immutable paths per system constraints.",
    "Backend must remain single-actor (all Motoko logic in backend/main.mo); only create backend/migration.mo changes if persistent state schema changes (not expected for this request).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Performing the actual platform deployment of Draft 23 (this build request covers code changes to fix the app opening and make the deployed draft identifiable).",
    "Adding third-party monitoring, analytics, or external logging services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}