{
  "kind": "build_request",
  "title": "Restore Home Header Profile & Notifications Controls (match Version 32)",
  "projectName": "EYEGIC Bookings",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the interactive “My Profile” and “Notifications” icon/buttons in the live UI so they appear and behave exactly as they did in Version 32.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "the my profile and notification icon/buttons are not seen in the live version as they were visible in version 32",
          "rebuild/fix the UI so the icons appear exactly as they did in Version 32 ... the icons were interactive in Version 32 and their behavior be restored as well"
        ]
      },
      "acceptanceCriteria": [
        "In production/live build, the “My Profile” control is visible and clickable when the user is authenticated, matching Version 32 appearance and interaction.",
        "In production/live build, the “Notifications” control is visible and clickable for admin users, matching Version 32 appearance and interaction.",
        "Clicking “My Profile” navigates to /profile.",
        "Clicking “Notifications” navigates to /admin/notifications.",
        "No console errors are introduced by the header changes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Show the restored “My Profile” and “Notifications” controls only in the Home page header (route “/”), and ensure they do not appear in the header on other routes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "these icons appear in the header of home page only"
        ]
      },
      "acceptanceCriteria": [
        "When the current route is “/”, the header displays the restored controls per authentication/admin rules.",
        "When the current route is not “/”, the header does not render the “My Profile” control and does not render the “Notifications” control.",
        "This rule applies consistently for both desktop header rendering and the mobile navigation experience (no alternate entry in the header or menu on non-home routes)."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit immutable hook files (frontend/src/hooks/useInternetIdentity.ts / .tsx and frontend/src/hooks/useActor.ts)."
  ],
  "nonGoals": [
    "Do not change backend data models or persistence related to notifications or profiles.",
    "Do not add new notification types/panels beyond restoring the existing navigation/control behavior.",
    "Do not change global navigation links (Mobile Optician / Rentals / Repairs) or authentication flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}