{
  "kind": "build_request",
  "title": "Fix Home hero text overlap/wrapping and apply the correct uploaded Eyegic logo everywhere",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Fix the Home page hero layout so the headline \"Eyewear Services, On Demand\" is fully visible next to the hero image (not obstructed/overlapped/hidden) and renders as one single unbroken line on desktop/tablet breakpoints where the hero is in a two-column layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "\"Eyewear Services, On Demand\" all in one line visible next to the image without being obstructed / over / under lapped"
        ]
      },
      "acceptanceCriteria": [
        "On the Home page at md and larger breakpoints (where the hero uses a two-column layout), the headline text \"Eyewear Services, On Demand\" appears on a single line.",
        "The headline is not covered by the hero image and does not render under/behind/overlapping the image at any md+ breakpoint.",
        "There is no horizontal clipping of the headline within its container at md+ breakpoints."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Readjust the Home page hero headline and supporting sentence font sizes (without changing the text content) so the supporting sentence \"Professional opticians, rentals, and repairs delivered to your doorstep.\" renders as a single unbroken line directly below the headline and remains fully visible (not overlapped by the hero image) on desktop/tablet breakpoints where the hero is in a two-column layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "the line \"Professional opticians, rentals, and repairs delivered to your doorstep.\" to be below the line/text \" \"Eyewear Services, On Demand\" all in one visible straight line. Readjust the font size of both the line in home page to make this happen."
        ]
      },
      "acceptanceCriteria": [
        "On the Home page at md and larger breakpoints, the supporting sentence renders as one single line and is positioned directly below the headline.",
        "The supporting sentence is not covered by or overlapping with the hero image at any md+ breakpoint.",
        "Only sizing/layout changes are used; the sentence text content remains exactly: \"Professional opticians, rentals, and repairs delivered to your doorstep.\""
      ]
    },
    {
      "id": "REQ-29",
      "text": "Add the newly uploaded logo image file \"EYEGIC LOGO for ID cards-2.png\" as a static frontend asset and update the BrandLogo component so the application uses this exact logo file everywhere the Eyegic logo is rendered (desktop header and mobile menu sheet included), replacing any previously referenced logo asset paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "also the logo is not which i asked you to upload. it seems autogenerated by you. Kindly use the logo file which i am again attaching with this message."
        ]
      },
      "acceptanceCriteria": [
        "The BrandLogo component renders the newly uploaded logo (\"EYEGIC LOGO for ID cards-2.png\") instead of the currently referenced logo asset.",
        "The desktop header logo and the mobile menu sheet logo both show the same newly uploaded logo.",
        "No other autogenerated/older Eyegic logo assets are referenced for the main site logo in the header or mobile menu sheet."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep all user-facing text in English; do not change the hero headline or supporting sentence text content."
  ],
  "nonGoals": [
    "No backend/canister changes.",
    "No changes to booking/rentals/repairs flows beyond the Home hero layout and logo asset usage.",
    "No new authentication or integrations."
  ],
  "imageRequirements": {
    "required": [
      "Uploaded Eyegic logo image (EYEGIC LOGO for ID cards-2.dim_1536x864.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}