{
  "kind": "build_request",
  "title": "Remove site logo and all logo-management features across the app",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove all logo rendering from the UI so that no logo image is displayed anywhere in the app, including the site header, mobile menu header area, and footer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "remove the logo from everywhere"
        ]
      },
      "acceptanceCriteria": [
        "No <img> or component renders the logo asset at /assets/generated/eyegic-logo.dim_1536x864.png anywhere in the UI.",
        "SiteHeader no longer imports or renders BrandLogo, including in the desktop header and mobile Sheet menu.",
        "SiteFooter no longer imports or renders BrandLogo."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the Branding/Logo settings UI entry points and route so users cannot navigate to or manage a logo through the frontend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "remove the logo from everywhere"
        ]
      },
      "acceptanceCriteria": [
        "The '/settings/branding' route is removed from the router configuration (frontend/src/App.tsx).",
        "All navigation links/buttons to Branding Settings are removed from SiteHeader and SiteFooter (including the mobile menu item).",
        "The BrandingLogoPage is no longer reachable via navigation or routing."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove frontend logo-fetch/upload logic and any now-unused utilities related to logo byte-to-data-url conversion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "remove the logo from everywhere"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/hooks/branding/useSiteLogo.ts is removed or no longer referenced anywhere in the frontend build.",
        "frontend/src/utils/logoDataUrl.ts is removed or no longer referenced anywhere in the frontend build.",
        "The app compiles with zero references to getLogo/setLogo actor methods and zero references to LogoType from the frontend."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Remove backend logo storage and APIs so the canister no longer supports uploading or retrieving a site logo.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "remove the logo from everywhere"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo no longer defines LogoType, persistentLogo state, or exposes getLogo()/setLogo() methods.",
        "Backend builds successfully and the Candid interface no longer includes logo-related methods.",
        "No new migration file is introduced unless required by compilation/upgrade constraints."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Remove the bundled static logo asset usage and ensure the repository no longer depends on the generated logo file.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "remove the logo from everywhere"
        ]
      },
      "acceptanceCriteria": [
        "No code references the static asset path '/assets/generated/eyegic-logo.dim_1536x864.png'.",
        "If the file frontend/public/assets/generated/eyegic-logo.dim_1536x864.png exists, it is removed from the project or left unused with no runtime references."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not modify any frontend files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT; compose existing components instead."
  ],
  "nonGoals": [
    "Do not redesign the overall site layout beyond removing logo-related UI elements.",
    "Do not add new branding features (themes, fonts, colors) as a replacement for the removed logo.",
    "Do not introduce any new authentication method beyond existing Internet Identity usage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}