{
  "kind": "build_request",
  "title": "Use only the uploaded EYEGIC logo file across the app",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Add the user-uploaded logo image file \"EYEGIC LOGO for ID cards-5.png\" to the frontend as a static asset and use this exact image as the only logo image used anywhere in the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "please use the file for logo attached with this message. please dont use any other logo. USE THE LOGO IN THIS FILE ONLY"
        ]
      },
      "acceptanceCriteria": [
        "The file \"EYEGIC LOGO for ID cards-5.png\" is included in the frontend static assets (e.g., under frontend/public/assets/generated/) and is loadable by the UI.",
        "No other logo image files are added or referenced anywhere in the repository or UI."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement a reusable BrandLogo component that renders the uploaded logo image, and replace the text-based brand rendering in the site header and footer with the BrandLogo component.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "USE THE LOGO IN THIS FILE ONLY"
        ]
      },
      "acceptanceCriteria": [
        "SiteHeader displays the uploaded logo image (not a text-only brand name) for both desktop header and the mobile sheet header area.",
        "SiteFooter displays the uploaded logo image (not a text-only brand name).",
        "BrandLogo uses only the uploaded file \"EYEGIC LOGO for ID cards-5.png\" as its image source and does not fetch logos from the backend or from any other asset."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Remove/avoid any remaining logo-related logic or references that would cause another logo to appear (including generated placeholder logos, previously bundled logo assets, or logo-management UI/hooks/utilities), while keeping existing settings routes for logo management disabled/absent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "please dont use any other logo"
        ]
      },
      "acceptanceCriteria": [
        "A search through the frontend codebase shows no references to any other logo asset filenames/paths besides \"EYEGIC LOGO for ID cards-5.png\".",
        "The app does not expose any logo upload/fetch/settings UI, and no backend calls exist in the frontend that attempt to retrieve or set a site logo."
      ]
    }
  ],
  "constraints": [
    "Use only the user-uploaded image file \"EYEGIC LOGO for ID cards-5.png\" for any logo rendering.",
    "Do not introduce or reference any additional logo assets (including replacements, placeholders, or alternate logo variants).",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding logo upload/change functionality in settings.",
    "Storing or serving the logo from the backend canister.",
    "Creating additional derived logo files such as favicons or alternate-sized logo variants."
  ],
  "imageRequirements": {
    "required": [
      "EYEGIC logo image (EYEGIC LOGO for ID cards-5.dim_1536x1024.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}