{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Home hero text layout fixes and correct Eyegic logo asset usage",
  "requirements": [
    {
      "id": "REQ-27",
      "summary": "Adjust the Home hero two-column layout so the headline is fully visible, non-overlapping, and stays on one line at md+ breakpoints.",
      "acceptanceCriteria": [
        "On the Home page at md and larger breakpoints (where the hero uses a two-column layout), the headline text \"Eyewear Services, On Demand\" appears on a single line.",
        "The headline is not covered by the hero image and does not render under/behind/overlapping the image at any md+ breakpoint.",
        "There is no horizontal clipping of the headline within its container at md+ breakpoints."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the hero section layout classes at md+ to prevent any overlap between the text column and hero image (e.g., ensure proper grid item sizing/min-width behavior, z-index/stacking if needed) and force the headline to render as a single unbroken line at md+ without clipping (e.g., md:whitespace-nowrap and appropriate responsive font sizing/line-height adjustments), while keeping the headline text content unchanged."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Readjust Home hero headline/supporting sentence sizing so the supporting sentence is a single line directly below the headline and remains fully visible at md+ breakpoints.",
      "acceptanceCriteria": [
        "On the Home page at md and larger breakpoints, the supporting sentence renders as one single line and is positioned directly below the headline.",
        "The supporting sentence is not covered by or overlapping with the hero image at any md+ breakpoint.",
        "Only sizing/layout changes are used; the sentence text content remains exactly: \"Professional opticians, rentals, and repairs delivered to your doorstep.\""
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Tune responsive typography and spacing for the hero headline and supporting sentence at md+ so the supporting sentence remains a single unbroken line directly beneath the headline (e.g., md:whitespace-nowrap plus coordinated md font-size adjustments), ensuring no overlap with the hero image and keeping the sentence text content exactly the same."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Add the uploaded Eyegic logo as a static asset and update BrandLogo to use it everywhere (header and mobile sheet included).",
      "acceptanceCriteria": [
        "The BrandLogo component renders the newly uploaded logo (\"EYEGIC LOGO for ID cards-2.png\") instead of the currently referenced logo asset.",
        "The desktop header logo and the mobile menu sheet logo both show the same newly uploaded logo.",
        "No other autogenerated/older Eyegic logo assets are referenced for the main site logo in the header or mobile menu sheet."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/EYEGIC LOGO for ID cards-2.dim_1536x864.png",
          "operation": "create",
          "description": "Add the uploaded logo asset file as a static public asset at this exact path so it can be referenced by the BrandLogo component."
        },
        {
          "path": "frontend/src/components/brand/BrandLogo.tsx",
          "operation": "modify",
          "description": "Replace the current logo src path with \"/assets/generated/EYEGIC LOGO for ID cards-2.dim_1536x864.png\" so BrandLogo renders the newly uploaded logo everywhere it is used (including the desktop header and the mobile menu sheet)."
        }
      ]
    }
  ]
}