{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix router startup crash and show build identifier (Draft 23)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix TanStack Router initialization to remove circular dependency and allow the app to render.",
      "acceptanceCriteria": [
        "Opening the app shows the Home page instead of a blank screen",
        "The browser console does not show a ReferenceError related to accessing `router` before initialization",
        "All existing routes continue to work (e.g., /, /provider/onboard, /my-profile)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor TanStack Router setup so createRootRoute no longer references `router` before it is initialized (e.g., root route renders a layout with Outlet). Ensure RouterProvider is only used at the app root and route tree remains unchanged so existing routes keep working."
        },
        {
          "path": "frontend/src/components/layout/RootLayout.tsx",
          "operation": "create",
          "description": "Create a shared root layout component that renders the global shell (e.g., SiteHeader, Outlet content area, SiteFooter) to be used as the root route component so routing can initialize without circular references."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Use a single React Query QueryClientProvider to avoid conflicting React Query setup.",
      "acceptanceCriteria": [
        "There is only one active QueryClientProvider in the render tree at runtime",
        "React Query hooks continue to function (queries and mutations still execute and cache as expected)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the QueryClient and QueryClientProvider from App so App is not nesting a second provider under the provider created in main.tsx."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Ensure the single QueryClient created here is configured with the desired defaults (matching prior app behavior where applicable) and remains the only QueryClientProvider wrapping the app."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a user-visible build identifier string configurable to \"Draft 23\" and displayed without authentication or backend calls.",
      "acceptanceCriteria": [
        "The UI displays a build identifier that reads \"Draft 23\" when configured to that value",
        "The build identifier is visible without requiring authentication",
        "The build identifier does not require any backend calls to display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/buildInfo.ts",
          "operation": "create",
          "description": "Add a small build-info configuration module exporting a build identifier value (defaulting to \"Draft 23\" and optionally overridable via a frontend build-time environment value) with no backend dependency."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Display the build identifier (from the build-info config) in a clearly visible footer area so it is always shown on public pages without requiring authentication."
        },
        {
          "path": "frontend/src/components/layout/RootLayout.tsx",
          "operation": "modify",
          "description": "Ensure the global footer (with the build identifier) is included in the app shell for all routes so the identifier is consistently visible."
        }
      ]
    }
  ]
}