{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace image-based logo branding with text-only “EYEGIC” across header and footer",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all rendered uses of the current logo image across the app and clean up any now-unused logo code.",
      "acceptanceCriteria": [
        "No rendered <img> in the app uses src \"/assets/generated/EYEGIC LOGO powered by lensdirect.dim_1536x1024.png\".",
        "Header, mobile menu header, and footer no longer display the logo image.",
        "App builds with no unused-import/typecheck errors after removing logo usage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/brand/BrandLogo.tsx",
          "operation": "modify",
          "description": "Remove the <img>-based logo rendering and any dependency on the image src; convert the component to render text-only branding so no UI path can render the old logo image."
        },
        {
          "path": "frontend/src/hooks/branding/useSiteLogo.ts",
          "operation": "delete",
          "description": "Remove the hook that hardcodes the logo image path so it cannot be referenced (directly or indirectly) after the text-only branding change."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Remove footer <img> logo rendering and remove useSiteLogo() import/usage; ensure there are no remaining references to the logo image path and the footer still compiles cleanly."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace the header brand logo area with a bold, text-only “EYEGIC” link to “/” across desktop and mobile header/menu, ensuring it scales to fit the header height.",
      "acceptanceCriteria": [
        "In the desktop header, the left brand element displays bold text \"EYEGIC\" (no logo image) and clicking it navigates to \"/\".",
        "The brand text scales to fit the header height (no vertical overflow/cropping) across responsive breakpoints.",
        "In the mobile menu header area (inside the Sheet), the brand text \"EYEGIC\" is shown instead of an image and still closes the menu on click if previously supported via onClick."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/brand/BrandLogo.tsx",
          "operation": "modify",
          "description": "Implement a text-only brand mark that renders exactly \"EYEGIC\" in bold, using responsive sizing (e.g., clamp-based Tailwind arbitrary value and tight leading) so it grows as large as possible while still fitting within the header height; preserve the existing Link to \"/\" and support the existing onClick behavior for mobile menu close."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Ensure the header and mobile Sheet header continue to use the brand component and that layout/className constraints allow the text-only \"EYEGIC\" mark to visually scale without overflow or cropping at the existing header heights across breakpoints."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the footer to remove the logo image and replace it with a text-only “EYEGIC” brand mark (or remove the logo area) while keeping layout and accessibility intact.",
      "acceptanceCriteria": [
        "The footer no longer renders an <img> for the site logo.",
        "Footer layout remains visually aligned (no broken spacing where the logo image used to be).",
        "No references to useSiteLogo() remain if it becomes unused by removing the image-based logo."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Replace the logo image area with a text-only \"EYEGIC\" brand mark (either as a Link to \"/\" or non-link text if preferred by existing footer layout), adjust spacing/alignment so the grid remains coherent, and ensure accessible semantics (no empty logo container)."
        },
        {
          "path": "frontend/src/hooks/branding/useSiteLogo.ts",
          "operation": "delete",
          "description": "Ensure footer cleanup leaves no remaining useSiteLogo() references anywhere in the frontend after removing the image-based logo."
        }
      ]
    }
  ]
}