{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore V27 admin notifications UI and My Profile completion indicator (frontend)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Restore admin header notifications control and ensure /admin/notifications shows OTP verification logs with admin-only access.",
      "acceptanceCriteria": [
        "For admin users, the header displays an Admin notifications control with a badge count equal to the number of verification log records.",
        "Clicking the Admin notifications control navigates to /admin/notifications.",
        "The /admin/notifications page renders a notifications panel listing verification records sorted newest-first and displaying mobile number and a human-readable timestamp.",
        "Non-admin users cannot access the /admin/notifications page (they see an access denied state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/header/AdminNotificationsControl.tsx",
          "operation": "modify",
          "description": "Update the Admin notifications control so the primary click action navigates directly to /admin/notifications (not just opening a dropdown), while keeping the badge count driven by useMobileNumberVerifications(). Use shadcn-ui Button for consistent styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Ensure the AdminNotificationsControl is rendered for admin users in both desktop header and mobile menu variants, and that the control remains discoverable/clickable in mobile layout. Use the authorization component’s role-based access via useIsCallerAdmin() to guard admin-only UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminNotificationsPage.tsx",
          "operation": "modify",
          "description": "Confirm admin-only gating behavior remains: RequireLogin wrapper + AccessDeniedScreen for non-admin, and render verification records newest-first with human-readable timestamps. Keep user-facing text in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify /admin/notifications route wiring exists and remains registered to AdminNotificationsPage (add/update route only if missing). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Restore the Version 27-style header My Profile control and show profile completion percentage under it in desktop header and mobile menu when authenticated.",
      "acceptanceCriteria": [
        "When authenticated, the header shows a 'My Profile' control that navigates to /profile.",
        "The control displays the profile completion percentage text beneath the button in desktop header variant.",
        "The same completion percentage text appears beneath the My Profile item in the mobile menu variant.",
        "When unauthenticated, the My Profile control is not shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/profile/useProfileCompletion.ts",
          "operation": "modify",
          "description": "Normalize the completion value returned from calculateProfileCompletion() for UI display: coerce to a whole-number 0–100 (e.g., clamp + round) and ensure stable behavior when actor is unavailable. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/header/MyProfileControl.tsx",
          "operation": "modify",
          "description": "Ensure the My Profile control matches Version 27 behavior: always show the percentage text under the control for both desktop and mobile variants when authenticated, and confirm navigation to /profile. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Confirm MyProfileControl is rendered only when authenticated and appears in both the desktop header area and mobile menu area with the percentage beneath it. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}