{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Use only the uploaded EYEGIC logo file across the app",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Add the uploaded EYEGIC logo as a static asset and ensure it is the only logo image used anywhere in the app.",
      "acceptanceCriteria": [
        "The file \"EYEGIC LOGO for ID cards-5.png\" is included in the frontend static assets (e.g., under frontend/public/assets/generated/) and is loadable by the UI.",
        "No other logo image files are added or referenced anywhere in the repository or UI."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/EYEGIC LOGO for ID cards-5.dim_1536x1024.png",
          "operation": "create",
          "description": "Add the required static logo asset at this exact path and filename so it can be used as the sole logo image throughout the UI."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create a reusable BrandLogo component for the uploaded logo and use it in the site header and footer (desktop and mobile header areas).",
      "acceptanceCriteria": [
        "SiteHeader displays the uploaded logo image (not a text-only brand name) for both desktop header and the mobile sheet header area.",
        "SiteFooter displays the uploaded logo image (not a text-only brand name).",
        "BrandLogo uses only the uploaded file \"EYEGIC LOGO for ID cards-5.png\" as its image source and does not fetch logos from the backend or from any other asset."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/brand/BrandLogo.tsx",
          "operation": "modify",
          "description": "Implement BrandLogo to render a single <img> that uses only frontend/public/assets/generated/EYEGIC LOGO for ID cards-5.dim_1536x1024.png as its source (no backend fetch, no alternative assets)."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Replace the text-based brand rendering with the BrandLogo component for both the desktop header brand area and the mobile sheet header area."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Replace the text-based brand rendering with the BrandLogo component in the footer branding area."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Remove/avoid any remaining non-uploaded logo references and disable/absent any logo-management UI/hooks/utilities in the frontend.",
      "acceptanceCriteria": [
        "A search through the frontend codebase shows no references to any other logo asset filenames/paths besides \"EYEGIC LOGO for ID cards-5.png\".",
        "The app does not expose any logo upload/fetch/settings UI, and no backend calls exist in the frontend that attempt to retrieve or set a site logo."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/branding/useSiteLogo.ts",
          "operation": "delete",
          "description": "Remove unused logo-fetching hook file to prevent future accidental backend logo retrieval logic from being introduced."
        },
        {
          "path": "frontend/src/utils/logoDataUrl.ts",
          "operation": "delete",
          "description": "Remove unused logo utility file to prevent alternate logo sources (data URLs / placeholders) from being used."
        },
        {
          "path": "frontend/src/pages/settings/BrandingLogoPage.tsx",
          "operation": "delete",
          "description": "Remove the (currently empty) branding logo settings page to keep logo management UI disabled/absent."
        },
        {
          "path": "frontend/public/assets/generated/eyegic-logo.dim_1536x864.png",
          "operation": "delete",
          "description": "Delete previously bundled/generated placeholder logo asset to ensure no alternate logo image can be referenced or displayed."
        },
        {
          "path": "frontend/public/assets/generated/eyegic-logo.dim_512x256.png",
          "operation": "delete",
          "description": "Delete previously bundled/generated placeholder logo asset to ensure no alternate logo image can be referenced or displayed."
        },
        {
          "path": "frontend/public/assets/generated/eyegic-icons.dim_512x512.png",
          "operation": "delete",
          "description": "Delete previously bundled/generated icon/logo-like asset to reduce the risk of an alternate logo appearing or being referenced."
        },
        {
          "path": "frontend/public/assets/generated/EYEGIC logo transparent background.png",
          "operation": "delete",
          "description": "Delete alternate EYEGIC logo asset variant so the codebase cannot reference anything other than the required uploaded logo file."
        }
      ]
    }
  ]
}