{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Implement restoration of Version 27 behavior: Admin dashboard notifications panel for OTP-verified users, and My Profile button showing profile-completion percentage based on all profile fields.",
  "architectural_notes": [],
  "known_issues": [],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-ensure-the-admin-notifications-ui-is-restored-in-the-header-for-admin-users-and-points-to-a-notifications-panel-in-the-admin-dashboard-that-lists-otp-verified-users-mobile-number-verified-time-matching-version-27-behavior",
      "title": "Ensure the Admin notifications UI is restored in the header for admin users and points to a notifications panel in the Admin dashboard that lists OTP-verified users (mobile number + verified time), matching Version 27 behavior.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-restore-the-header-my-profile-control-exactly-as-in-version-27-including-showing-the-profile-completion-percentage-beneath-the-my-profile-button-in-both-desktop-header-and-mobile-menu-variants",
      "title": "Restore the header 'My Profile' control exactly as in Version 27, including showing the profile completion percentage beneath the My Profile button in both desktop header and mobile menu variants.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Show OTP-verified user interest notifications inside Admin dashboard via a notifications panel (no email/SMS), including the verified user mobile number.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Restore My Profile button to display profile completion percentage calculated from all fields in the My Profile section.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Persist and expose mobile-number OTP verification logs so that when a user successfully verifies their mobile number by OTP, an admin can see a notification entry containing the verified mobile number and a verification timestamp (no email/SMS).",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Update profile completion calculation so the completion percentage is based on all fields in the My Profile section, and return a 0–100 integer percentage for display in the header My Profile control.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "EYEGIC Bookings",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}